target/classes/postAuthor.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lib="libraryService">
    <soapenv:Header/>
    <soapenv:Body>
        <lib:createAuthorRequest>
            <lib:author>
                <lib:authorId>%s</lib:authorId>
                <lib:authorName>
                    <lib:first>%s</lib:first>
                    <lib:second>%s</lib:second>
                </lib:authorName>
                <lib:nationality>%s</lib:nationality>
                <lib:birth>
                    <lib:date>%s</lib:date>
                    <lib:country>%s</lib:country>
                    <lib:city>%s</lib:city>
                </lib:birth>
                <lib:authorDescription>%s</lib:authorDescription>
            </lib:author>
        </lib:createAuthorRequest>
    </soapenv:Body>
</soapenv:Envelope>